[
    {
        "title": "Software Engineer",
        "company": "Teradata",
        "location": "Hyderabad, Telangana",
        "description": "Job Description : What You'll Do : - Design, implement, review, test, deploy and maintain innovative AI/ML software solutions to data analysis across the Teradata Vantage platform (a critical Teradata strategic component). - Conduct performance and scalability testing, identify and analyze the bottlenecks for the AI/ML applications to ensure they meet operational requirements. - Advocate for quality throughout the development lifecycle, emphasizing the unique challenges of AI/ML and cloud techn…",
        "url": "https://www.adzuna.in/land/ad/5010622321?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=4633DE72EC4FC08A34188DFFB345B4B167C3B053"
    },
    {
        "title": "Software Engineering Advisor",
        "company": "Evernorth",
        "location": "Hyderabad, Telangana",
        "description": "About Evernorth: Evernorth Health Services, a division of The Cigna Group (NYSE: CI), creates pharmacy, care, and benefits solutions to improve health and increase vitality. We relentlessly innovate to make the prediction, prevention, and treatment of illness and disease more accessible to millions of people. Position Summary: Evernorth, a leading Health Services company, is looking for an exceptional software engineer to add to our Data & Analytics Engineering organization. The software engine…",
        "url": "https://www.adzuna.in/land/ad/5001721129?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=731585971377491CD6AF57711EFC5FA12D62E857"
    },
    {
        "title": "Software Engineering Analyst",
        "company": "Evernorth",
        "location": "Hyderabad, Telangana",
        "description": "About Evernorth Evernorth Health Services, a division of The Cigna Group (NYSE: CI), creates pharmacy, care, and benefits solutions to improve health and increase vitality. We relentlessly innovate to make the prediction, prevention, and treatment of illness and disease more accessible to millions of people. Software Engineering Analyst Position Overview: Evernorth Core Platform Engineering team is looking for a Software Engineering Analyst to develop and implement robust product APIs and event…",
        "url": "https://www.adzuna.in/land/ad/4951248615?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=E38F644C895CC0BC4943D484B1123B832D4B6061"
    },
    {
        "title": "Embedded Software Engineer -",
        "company": "Aricent",
        "location": "India",
        "description": "Designation : Embedded Software Engineer Work from home / Work from office (Optional) Job description : - Working in cross-discipline design teams involving software, electrical, controls, and mechanical engineers designing new equipment to meet customer needs. - Developing embedded and interface software, providing feedback to schematic design, reviewing PCB layouts, prototyping circuits, debugging analog and digital hardware, automating testing, developing user libraries to control hardware, …",
        "url": "https://www.adzuna.in/land/ad/5007291885?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=7DA86FDCCC9957AABCDDEDCAB1FC66ECF2B70326"
    },
    {
        "title": "Software Engineering Advisor",
        "company": "Evernorth",
        "location": "Hyderabad, Telangana",
        "description": "About Evernorth: Evernorth Health Services, a division of The Cigna Group (NYSE: CI), creates pharmacy, care, and benefits solutions to improve health and increase vitality. We relentlessly innovate to make the prediction, prevention, and treatment of illness and disease more accessible to millions of people. Software Engineering Advisor Position Overview: Are you looking for an opportunity to engineer modern Cloud application, Continuous Deployment / Continuous Integration, and infrastructure …",
        "url": "https://www.adzuna.in/land/ad/5018115576?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=8D0E928BF353ABAB5AF41A153AB53E1E52135F3F"
    },
    {
        "title": "Director of Software Engineering",
        "company": "Searce",
        "location": "Pune, Maharashtra",
        "description": "Do you want to create impactful, futuristic outcomes for businesses across the globe? Can you lead a team of solvers to success? Then this role is perfect for you Job Title : Director / VP Software Engineering. Role : To deliver faster, smarter, better business outcomes for our clients & partners. Job Description : What are we looking for? This entrepreneurial technology leadership position challenges the client status quo by helping them re imagine the art of what is possible using a consultin…",
        "url": "https://www.adzuna.in/land/ad/5002660253?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=289F754F4C65D3FAD8EF00DC756E4D3949098F85"
    },
    {
        "title": "Software Engineer - DevOps",
        "company": "own world",
        "location": "India",
        "description": "Job Description : - Deploy updates and fixes, and provide Level 2 technical support - Build tools to reduce occurrence of errors and improve customer experience - Develop software to integrate with internal back-end systems - Perform root cause analysis of production errors and resolve technical issues - Develop scripts to automate visualization - Design procedures for system troubleshooting and maintenance Required skills and qualifications : - Experience as a DevOps engineer or in a similar s…",
        "url": "https://www.adzuna.in/land/ad/4952687072?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=10D3390083EB8E0FCF8F3F4C93D101A1900100AC"
    },
    {
        "title": "Software Engineering Advisor",
        "company": "Evernorth",
        "location": "Hyderabad, Telangana",
        "description": "About Evernorth: Evernorth Health Services, a division of The Cigna Group (NYSE: CI), creates pharmacy, care, and benefits solutions to improve health and increase vitality. We relentlessly innovate to make the prediction, prevention, and treatment of illness and disease more accessible to millions of people. Software Engineering Advisor Position Overview: Join Evernorth's Engineering Acceleration team in the software engineering excellence organization as a Full Stack Engineer. The team build …",
        "url": "https://www.adzuna.in/land/ad/4947202184?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=6E2F05E78B9132FD61BD0BEF75E44814A3CB1051"
    },
    {
        "title": "Manager - Software Engineering",
        "company": "NPS Prism",
        "location": "India",
        "description": "Title : Manager - Software Engineering Reports- to : Head - Engineering Company Profile : NPS Prism is a market-leading, cloud-based CX benchmarking and operational improvement platform owned by Bain & Company. NPS Prism provides its customers with actionable insights and analysis that guide the creation of game-changing customer experiences. Based on rock-solid sampling, research, and analytic methodology, it lets customers see how they compare to their competitors on overall NPS- , and on eve…",
        "url": "https://www.adzuna.in/land/ad/5006135036?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=24B4D26753C4FB44DF125960584D6E48AF38E919"
    },
    {
        "title": "Sr Software Engineer",
        "company": "HME",
        "location": "Bangalore, Karnataka",
        "description": "About HME: For over 50 years, HME has created industry-leading products and services, their earliest being the first wireless microphone for the professional audio market in 1974. Since then, they have evolved greatly and pioneered into a variety of niche markets, setting new benchmarks with their work. HME believes that theres more to a person than whats written on their resume. HME sees their employees for who they are and value every idea and opinion its what fuels their innovative thinking …",
        "url": "https://www.adzuna.in/land/ad/5003001626?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=740AFAF3A0D2E4E1DC948ED89044FD2CD05BD436"
    },
    {
        "title": "Software Engineering Manager",
        "company": "Evernorth",
        "location": "Hyderabad, Telangana",
        "description": "About Evernorth Evernorth Health Services, a division of The Cigna Group (NYSE: CI), creates pharmacy, care, and benefits solutions to improve health and increase vitality. We relentlessly innovate to make the prediction, prevention, and treatment of illness and disease more accessible to millions of people. Software Engineering Manager Position Overview Seeking a software engineering manager to join the Evernorth Core Platforms Engineering team. This role will lead a team focused on delivering…",
        "url": "https://www.adzuna.in/land/ad/4963670594?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=9C5487B0085082951CA4E0471EF8E496597F3E49"
    },
    {
        "title": "Software Engineering Advisor",
        "company": "Evernorth",
        "location": "Hyderabad, Telangana",
        "description": "About Evernorth: Evernorth Health Services, a division of The Cigna Group (NYSE: CI), creates pharmacy, care, and benefits solutions to improve health and increase vitality. We relentlessly innovate to make the prediction, prevention, and treatment of illness and disease more accessible to millions of people. Software Engineering Advisor Position Overview: The job profile for this position is Software Engineering Advisor, which is a Band 4 Contributor Career Track Role. Excited to grow your car…",
        "url": "https://www.adzuna.in/land/ad/4996134882?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=5978A86EDB9BA608BE85E4A9C7B508700D11A0F2"
    },
    {
        "title": "Software Engineer - Frontend",
        "company": "XHire.One",
        "location": "Mumbai, Maharashtra",
        "description": "Role : Software Engineer - Frontend Job Description : - Develop and maintain high-quality, scalable, and reusable code for frontend components using ReactJS. - Work closely with the backend team to integrate APIs and develop dynamic, responsive web applications. - Implement state management solutions effectively to ensure smooth and predictable state transitions within the application. - Employ best practices for Frontend CI/CD to streamline development, testing, and deployment processes. - Wri…",
        "url": "https://www.adzuna.in/land/ad/4989988211?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=28EB2FD1C5D862243D97F23517351EC02C9C59A3"
    },
    {
        "title": "Software Engineer - C++",
        "company": "Aricent",
        "location": "India",
        "description": "Role: Software Engineer - C++ Job description : - Responsible for the development of access control software for products following our Software Development Process - Participating and assisting in the development of software requirements specifications and software functional specifications - Coding, testing, debugging and modifying complex systems software to ensure conformance to design specifications and the JCI Software Development Process - Communicate within the team to understand requir…",
        "url": "https://www.adzuna.in/land/ad/5018888595?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=20E3833AE7A9AD6CC1F169C0DAF33EB44EA5668C"
    },
    {
        "title": "Senior Software Engineer",
        "company": "Ferguson",
        "location": "Bangalore, Karnataka",
        "description": "Duties and Responsibilities: Develop and maintain high-quality, efficient, and testable code using Java and other backend technologies. Collaborate with multi-functional teams, including technical leads, business collaborators, and product owners, to gather and understand project requirements and acceptance criteria. Integrate data from various backend services and databases, ensuring seamless functionality. Troubleshoot, debug, and resolve issues in existing applications to maintain optimal pe…",
        "url": "https://www.adzuna.in/land/ad/4990135566?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=537B6C29E57B543EBD85C179B117F4F28654D19F"
    },
    {
        "title": "Software Engineering Advisor",
        "company": "Evernorth",
        "location": "Hyderabad, Telangana",
        "description": "About Evernorth: Evernorth Health Services, a division of The Cigna Group (NYSE: CI), creates pharmacy, care, and benefits solutions to improve health and increase vitality. We relentlessly innovate to make the prediction, prevention, and treatment of illness and disease more accessible to millions of people. Software Engineering Advisor Frontend Roles & Responsibilities Develop, and maintain high-quality React Native applications using clean code. Use additional JavaScript libraries, such as R…",
        "url": "https://www.adzuna.in/land/ad/4982871618?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=2F71EC39F4CBCEBE10140C97BD7AECFACCB34C5F"
    },
    {
        "title": "Software Engineering Advisor",
        "company": "Evernorth",
        "location": "Hyderabad, Telangana",
        "description": "About Evernorth: Evernorth Health Services, a division of The Cigna Group (NYSE: CI), creates pharmacy, care, and benefits solutions to improve health and increase vitality. We relentlessly innovate to make the prediction, prevention, and treatment of illness and disease more accessible to millions of people. Software Engineering Advisor Position Overview: Join the team that manages the end to end technology and life cycle management of the applications hosted both on premise and in the AWS/Azu…",
        "url": "https://www.adzuna.in/land/ad/4963670584?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=7195E5C410ADC03013257F0E9D62D79A85806A6D"
    },
    {
        "title": "Software Engineer - C++",
        "company": "e-Hireo Global Solutions",
        "location": "Bangalore, Karnataka",
        "description": "Position : C++ Software Engineer Location : Bangalore, India Exp : 4-8 Yrs Must have experience in : - C++ - QT (Must have ) - Algorithms and Data Structures - Design Patterns - REST API's - Desktop Applications /Windows Application Duties & Responsibilities : - Conducts systems and requirements analyses to identify project action items. - Contributes to task lists and cost and time estimates to support project plan development. - Performs assigned functions and tasks to meet project plan and q…",
        "url": "https://www.adzuna.in/land/ad/5018888913?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=607F2EB6CA456CE5E62C2C54F6C3EC6D6EECEA3A"
    },
    {
        "title": "Software Engineering Principal",
        "company": "Evernorth",
        "location": "Hyderabad, Telangana",
        "description": "About Evernorth: Evernorth Health Services, a division of The Cigna Group (NYSE: CI), creates pharmacy, care, and benefits solutions to improve health and increase vitality. We relentlessly innovate to make the prediction, prevention, and treatment of illness and disease more accessible to millions of people. Software Engineering Principal Position Overview: Evernorth Core Platform Engineering team is looking fora highly experienced and visionary Principal Architect to guide our company on stra…",
        "url": "https://www.adzuna.in/land/ad/4956248555?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=5D2970438C810A4188C58D9A2A1A48853A6CE7EE"
    },
    {
        "title": "Principal Software Engineer",
        "company": "Mastercard",
        "location": "Khadki, Pune",
        "description": "Our Purpose Mastercard powers economies and empowers people in 200 countries and territories worldwide. Together with our customers, we’re helping build a sustainable economy where everyone can prosper. We support a wide range of digital payments choices, making transactions secure, simple, smart and accessible. Our technology and innovation, partnerships and networks combine to deliver a unique set of products and services that help people, businesses and governments realize their greatest pot…",
        "url": "https://www.adzuna.in/land/ad/5015277564?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=FF43C13C8A6A2E06FAC56FFACE1226D312EA0B9B"
    },
    {
        "title": "Software Engineering Analyst",
        "company": "Evernorth",
        "location": "Hyderabad, Telangana",
        "description": "About Evernorth: Evernorth Health Services, a division of The Cigna Group (NYSE: CI), creates pharmacy, care, and benefits solutions to improve health and increase vitality. We relentlessly innovate to make the prediction, prevention, and treatment of illness and disease more accessible to millions of people. Position Summary: The AI CoE team is seeking Fullstack Software Engineers to work on the AI ecosystem. The Fullstack Engineer will be responsible for designing, implementing, and deploying…",
        "url": "https://www.adzuna.in/land/ad/5009625602?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=BC3B30878E87FF8C8789F5231862E4C3A255D9E9"
    },
    {
        "title": "Senior software engineer",
        "company": "Kenvue",
        "location": "Bangalore, Karnataka",
        "description": "About Kenvue: Kenvue is the worlds largest pure-play consumer health company by revenue. Built on more than a century of heritage, our iconic brands, including Aveeno, Johnsons, Listerine, and Neutrogena are science-backed and recommended by healthcare professionals around the world. At Kenvue, we believe in the extraordinary power of everyday care and our teams work every day to put that power in consumers hands and earn a place in their hearts and homes. What You will Do ? As a senior enginee…",
        "url": "https://www.adzuna.in/land/ad/5018115682?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=7D53FD5FF4B0BB81CE27EC3AA4EAB4598A1B7AA1"
    },
    {
        "title": "Software Engineer - APIGEE",
        "company": "iXceed Solutions",
        "location": "Chennai, Tamil Nadu",
        "description": "Job Description : Key Responsibilities : Requirement Gathering and Development : - Work closely with business and technical teams to gather requirements and develop code for API-related solutions using APIGEE. - Design, develop, and implement scalable, high-performance APIs that align with business requirements. API and Apache Kafka Implementation : - Leverage APIGEE for API management, integration, and implementation. - Implement Apache Kafka for event streaming, ensuring smooth data flow betw…",
        "url": "https://www.adzuna.in/land/ad/4960328516?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=E6F6863A075274DF8F40C67E611F3BB2FFA4A2D7"
    },
    {
        "title": "Staff Software Engineer",
        "company": "ANSR Summit Consulting",
        "location": "Gurgaon, Haryana",
        "description": "Role and Responsibilities: Deliver highly scalable, available, and fault-tolerant production applications. Help prevent and investigate production issues. Build architecture design, influence product roadmap, and take ownership and responsibility over new projects. Lead code/design reviews to ensure smooth daily operations and accurate planning Participate in the entire application lifecycle, focusing on coding and debugging Write clean code to develop functional applications Identify bottlenec…",
        "url": "https://www.adzuna.in/land/ad/4969643058?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=00F7FD85B6DE3F0C09DCE60A34EC5E6A15805731"
    },
    {
        "title": "Principal Software Engineer",
        "company": "ANSR Summit Consulting",
        "location": "Gurgaon, Haryana",
        "description": "Role and Responsibilities: Own the definition, design, development, delivery and quality for large feature sets, subsystems, or products. Deliver highly scalable, available, and fault-tolerant production applications. Help prevent and investigate production issues. Build architecture design, ensure the quality of architecture and design of systems, influence product roadmap, and take ownership and responsibility over new projects. Lead code/design reviews to ensure smooth daily operations and a…",
        "url": "https://www.adzuna.in/land/ad/4969643010?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=F180DC766192194D176BB6982E468A9EA367201C"
    },
    {
        "title": "Senior Software Engineer",
        "company": "Corpxcel Consulting",
        "location": "Bangalore, Karnataka",
        "description": "Software Development : - Design, develop, and maintain scalable software solutions for complex requirements. - Build and enhance Web Services/REST APIs to integrate and support enterprise systems. - Lead the development of user interfaces with strong CSS and UI frameworks. AWS Cloud and Serverless Services : - Architect and manage solutions using AWS Serverless services, including AWS Lambda, API Gateway, DynamoDB, S3, Cognito, SQS, and SNS. - Design and optimize cloud-hosted systems with a foc…",
        "url": "https://www.adzuna.in/land/ad/4976136769?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=C1F405CEAEE997C84888F3F740A0A41BED55B990"
    },
    {
        "title": "Software Engineer - Java",
        "company": "COGNITUD ADVISORY SERVICES PRIVATE LIMITED",
        "location": "Bangalore, Karnataka",
        "description": "Domain : Application Development. Position : Java Developer. Experience : 5-9 Years. Location : Bangalore, Hyderabad, Pune. Your Team. You will work with a top-tier organization that's been in the game for 50 years, partnering with some of the world's biggest businesses. As India's largest multinational business group, they boast a workforce of over 500,000 highly skilled consultants spread across 46 countries. Beyond that, they're at the forefront of the financial markets and data industry, de…",
        "url": "https://www.adzuna.in/land/ad/5021502670?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=F7C5E33EDF7755E2897B46F6E2679E8943B0F036"
    },
    {
        "title": "Lead Software Engineer",
        "company": "Futurestep Recruitment Services Private Limited",
        "location": "India",
        "description": "We are seeking engineers with diverse specialties and skills to join our dynamic team to innovate and solve complex challenges. Our team is looking for strong talent with expertise in the following areas : - Back End Engineer (API Development, Database Management, Security Practices, Message Queuing) Responsibilities : - Software Development : Write clean, maintainable, and efficient code or various software applications and systems. - Technical Leadership : Contribute to the design, developmen…",
        "url": "https://www.adzuna.in/land/ad/5021502825?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=4FA16DFF2037E65D98F5F1B7E081676A317A49DD"
    },
    {
        "title": "Software Engineer - DevOps",
        "company": "NPG Consultants",
        "location": "Delhi, India",
        "description": "One of the leading retail food chain company of india is looking out for Software Developer ( DEvops) Key responsibilities : - Build resilient and sustenance cloud infrastructure. Be the first line of contact for daily operations. Enrich the cloud infrastructure uptime by minimizing the Incidents, watching the proactive alerts. Must be available to support the crises situation 24- 7. - Manage the monitoring, updating, optimization, redundancy, stability of cloud systems and take complete contro…",
        "url": "https://www.adzuna.in/land/ad/5021502770?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=8ADE33D1327D47675F497AD4696A7BB79DFD9BD5"
    },
    {
        "title": "Software Engineer - DevOps",
        "company": "Anveta",
        "location": "Mumbai, Maharashtra",
        "description": "Exp : 8 - 12 Yrs Location : BKC, Mumbai Skills : unix, shell scripting, devops 1. Collaborating with Development and Operations Teams : - Serving as a liaison between development and operations, encouraging communication and collaboration to align goals and streamline processes. - Facilitating cross-functional collaboration and ensuring seamless transitions between development, testing, and deployment phases. - Identifying and resolving bottlenecks in the software delivery lifecycle. 2. Automat…",
        "url": "https://www.adzuna.in/land/ad/4989987941?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=4DD8FB892C71CAD67A1D759CED020CD622D661DA"
    },
    {
        "title": "Software Engineer - Java",
        "company": "Paddlelift",
        "location": "India",
        "description": "Responsibilities : - Design and ship great user experiences. - Write easy-to-maintain products and systems with reliable unit/functional tests and tracking (analytics, logging, and qualitative feedback). - Applies deep technical expertise and problem-solving methodologies focused on analyzing complex data and systems, anticipating issues, and finding ways to mitigate risk. - Executes work according to compliance standards, risk and security, and business objectives. - Contribute to documentatio…",
        "url": "https://www.adzuna.in/land/ad/5021502693?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=D359C6069DB428BB0FE69B1A0CC2A0E9533E7A16"
    },
    {
        "title": "Manager - Software Engineering",
        "company": "tagged",
        "location": "India",
        "description": "Job Description : - Run the production environment by monitoring availability and taking a holistic view of system health - Build software and systems to manage platform infrastructure and applications - Improve reliability, quality, and time-to-market of our suite of software solutions - Measure and optimize system performance, with an eye toward pushing our capabilities forward, getting ahead of customer needs, and innovating to continually improve - Provide primary operational support and en…",
        "url": "https://www.adzuna.in/land/ad/5013558461?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=AF6EDD72A65503824697CE127009941AB49BAF4E"
    },
    {
        "title": "Senior Software Engineer",
        "company": "BBY India",
        "location": "Bangalore, Karnataka",
        "description": "Key Responsibilities Lead the delivery of complex solutions, coding larger features from start to finish Actively participate in planning, and performing code and architecture reviews of their teams product Help ensure the quality and integrity of the Software Development Life Cycle (SDLC) for their team and identify opportunities for improvement in how the team works, through usage of recommended tools and practices. Lead the triage of complex production issues across systems Demonstrate creat…",
        "url": "https://www.adzuna.in/land/ad/4948421027?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=9DC6F556CE23470EA5AEA32A7466858327AA183B"
    },
    {
        "title": "Software Engineering Advisor",
        "company": "Evernorth",
        "location": "Hyderabad, Telangana",
        "description": "About Evernorth Evernorth Health Services, a division of The Cigna Group (NYSE: CI), creates pharmacy, care, and benefits solutions to improve health and increase vitality. We relentlessly innovate to make the prediction, prevention, and treatment of illness and disease more accessible to millions of people. Position Overview We're looking for a talented Front-end Engineer to create intuitive, responsive, and visually appealing user interfaces for our AI-powered applications. You'll work at the…",
        "url": "https://www.adzuna.in/land/ad/4969643048?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=448ACD9EE14A0AC7EBC3C126CD3F111DCD996DAF"
    },
    {
        "title": "Software Engineering Advisor",
        "company": "Evernorth",
        "location": "Hyderabad, Telangana",
        "description": "About Evernorth: Evernorth Health Services, a division of The Cigna Group (NYSE: CI), creates pharmacy, care, and benefits solutions to improve health and increase vitality. We relentlessly innovate to make the prediction, prevention, and treatment of illness and disease more accessible to millions of people. Responsibilities: Candidates will need to have experience with medium-to-large-scale web development. Ability to develop within full technology stack Be part of a fast moving team, working…",
        "url": "https://www.adzuna.in/land/ad/5013873090?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=B6378E709347721F6D7876C42FF36D04EB002645"
    },
    {
        "title": "Software Engineer I",
        "company": "BBY India",
        "location": "Bangalore, Karnataka",
        "description": "Key Responsibilities: Independently complete small- to medium-sized features and defects Participate in team planning activities Able to triage simple issues independently, and more complex issues with some assistance Participate in technical design and review of features, with guidance Consistently follow best practices and guidelines Help to mentor new team members Know how to prioritize your own work Understand the business supported by your applications Proactively communicate status and is…",
        "url": "https://www.adzuna.in/land/ad/4960316078?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=42CFB54EE9D21DE3646F53BC29260E93F39BF63D"
    },
    {
        "title": "Software Engineer II",
        "company": "BBY India",
        "location": "Bangalore, Karnataka",
        "description": "Key Responsibilities Contribute to the delivery of complex solutions, breaking down big problems into smaller pieces Actively participate in team planning activities Help ensure the quality and integrity of the SDLC for their team and identify opportunities for improvement in how the team works, through usage of recommended tools and practices. Able to triage complex issues independently Aware of the technology landscape, help to plan delivery of coarse-grained business needs spanning multiple …",
        "url": "https://www.adzuna.in/land/ad/4956248562?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=F2EC398F9BE7DAA21A578188FFD16375AB2A55DB"
    },
    {
        "title": "Software Engineering Advisor",
        "company": "Evernorth",
        "location": "Hyderabad, Telangana",
        "description": "About Evernorth: Evernorth Health Services, a division of The Cigna Group (NYSE: CI), creates pharmacy, care, and benefits solutions to improve health and increase vitality. We relentlessly innovate to make the prediction, prevention, and treatment of illness and disease more accessible to millions of people. Responsibilities: Candidates will need to have experience with medium-to-large-scale web development. Ability to develop within full technology stack Be part of a fast moving team, working…",
        "url": "https://www.adzuna.in/land/ad/5013873325?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=440D5B5E088B230453DBB8D1401B7F37AB2AB1FF"
    },
    {
        "title": "Staff Software Engineer",
        "company": "ANSR Summit Consulting",
        "location": "Gurgaon, Haryana",
        "description": "Role and Responsibilities: Lead code/design reviews to ensure smooth daily operations and accurate planning Participate in the entire application lifecycle, focusing on coding and debugging Write clean code to develop functional web applications Advanced troubleshooting and debugging Perform UI tests to optimize performance Liaise with developers, designers and system administrators to identify new features Manage cutting-edge technologies to improve legacy applications Gather and address techn…",
        "url": "https://www.adzuna.in/land/ad/4969643060?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=34C49E55932BB6E5F8A7E6EAC9D62F66DBE7F7FC"
    },
    {
        "title": "Lead Software Engineer",
        "company": "Ferguson",
        "location": "Bangalore, Karnataka",
        "description": "Duties and Responsibilities: Design, develop, and maintain high-performance REST / SOAP APIs and services using Java, Spring, and related frameworks. Lead end-to-end project execution, from design and implementation to deployment and support. Collaborate with multi-functional teams to deliver scalable, secure, and reliable solutions that align with Fergusons strategic goals. Analyze complex system issues, solve problems, and implement innovative solutions. Integrate with third-party systems and…",
        "url": "https://www.adzuna.in/land/ad/4990135542?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=B09D67552BAFB5E777AC12842E58F99CA4708187"
    },
    {
        "title": "Lead Software Engineer",
        "company": "Ferguson",
        "location": "Bangalore, Karnataka",
        "description": "Duties and Responsibilities: Develop and maintain websites and software applications for the Enterprise Product Solutions Services group, ensuring seamless integration with backend systems and performance optimization. Create and maintain user interfaces using HTML, CSS, JavaScript, and modern frameworks, ensuring cross-browser compatibility and adherence to modern web standards. Collaborate with design teams to translate UI/UX wireframes into high-quality, functional code. Work closely with ba…",
        "url": "https://www.adzuna.in/land/ad/5004649739?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=F6B271C0074A20962F19A4081B012FDF2EA3E0C7"
    },
    {
        "title": "Senior Software Engineer",
        "company": "Ferguson",
        "location": "Bangalore, Karnataka",
        "description": "Duties and Responsibilities: Design and develop web services and integrations to automate, improve, or change business processes and procedures. Consistently deliver quality software that implements the design per business and technical requirements. Ensure that developed software is both performant and scalable to meet Fergusons evolving business needs. Involved in project from analysis through implementation to ensure all aspects of the technology plan is accounted for, understood, defined, a…",
        "url": "https://www.adzuna.in/land/ad/5000431862?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=7C7461600496913B199CB7EDEF7AA26E1B841679"
    },
    {
        "title": "Software Engineering Advisor",
        "company": "Evernorth",
        "location": "Hyderabad, Telangana",
        "description": "About Evernorth: Evernorth Health Services, a division of The Cigna Group (NYSE: CI), creates pharmacy, care, and benefits solutions to improve health and increase vitality. We relentlessly innovate to make the prediction, prevention, and treatment of illness and disease more accessible to millions of people. Responsibilities: Candidates will need to have experience with medium-to-large-scale web development. Ability to develop within full technology stack Be part of a fast moving team, working…",
        "url": "https://www.adzuna.in/land/ad/5006473500?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=4A54B8767B56F314C15C53777E169C1D67F70490"
    },
    {
        "title": "Software Engineer II",
        "company": "BBY India",
        "location": "Bangalore, Karnataka",
        "description": "Key Responsibilities Contribute to the delivery of complex solutions, breaking down big problems into smaller pieces Actively participate in team planning activities Help ensure the quality and integrity of the SDLC for their team and identify opportunities for improvement in how the team works, through usage of recommended tools and practices. Able to triage complex issues independently Aware of the technology landscape, help to plan delivery of coarse-grained business needs spanning multiple …",
        "url": "https://www.adzuna.in/land/ad/4947201355?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=951F04EC06E94F8CDEC0D7FB89E54F614B290893"
    },
    {
        "title": "Software Engineering Advisor",
        "company": "Evernorth",
        "location": "Hyderabad, Telangana",
        "description": "About Evernorth: Evernorth Health Services, a division of The Cigna Group (NYSE: CI), creates pharmacy, care, and benefits solutions to improve health and increase vitality. We relentlessly innovate to make the prediction, prevention, and treatment of illness and disease more accessible to millions of people. Application Development Advisor - Pega Position Overview: As an Advisor developer, you will be involved in design, development, and testing of Pega PRPC (Pega Rules Process Commander) and …",
        "url": "https://www.adzuna.in/land/ad/4966364665?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=F1B424B2EE73A2D15A6D72E78085101F27F89CDC"
    },
    {
        "title": "Software Engineering Advisor",
        "company": "Evernorth",
        "location": "Hyderabad, Telangana",
        "description": "About Evernorth Evernorth Health Services, a division of The Cigna Group (NYSE: CI), creates pharmacy, care, and benefits solutions to improve health and increase vitality. We relentlessly innovate to make the prediction, prevention, and treatment of illness and disease more accessible to millions of people. Application Development Advisor Full-Stack Position Overview We're seeking a versatile Full-stack Engineer to contribute to all aspects of our AI-powered applications. You'll work across th…",
        "url": "https://www.adzuna.in/land/ad/4969643051?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=A014A4E677694694620A83255F4F21506CD328FD"
    },
    {
        "title": "Lead Software Engineer",
        "company": "Ferguson",
        "location": "Bangalore, Karnataka",
        "description": "Duties and Responsibilities: Design, develop, and maintain responsive, user-facing features using HTML, CSS, JavaScript, and modern frameworks like React, Angular, or Vue. Work closely with designers to transform UI/UX wireframes into clean, efficient, and high-quality code. Optimize web applications for maximum performance, speed, and scalability. Ensure the technical feasibility of design concepts, proactively addressing any limitations. Conduct thorough code reviews, offering constructive fe…",
        "url": "https://www.adzuna.in/land/ad/5006473521?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=54282F8944C0D27BE9109DDE3581FD21E60DF9EE"
    },
    {
        "title": "DigiCert - Manager - Software Engineering",
        "company": "DigiCert",
        "location": "Bangalore, Karnataka",
        "description": "Who we are? - We're a leading, global security authority that's disrupting our own category. - Our encryption is trusted by the major ecommerce brands, the world's largest companies, the major cloud providers, entire country financial systems, entire internets of things and even down to the little things like surgically embedded pacemakers. - We help companies put trust an abstract idea to work. - That's digital trust for the real world. Job Summary : - DigiCert is seeking to hire a Software En…",
        "url": "https://www.adzuna.in/land/ad/4965040360?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=8AA3870254081462907E33AEB3490D810B2CEA4F"
    },
    {
        "title": "DigiCert - Software Engineering Manager",
        "company": "DigiCert",
        "location": "Bangalore, Karnataka",
        "description": "Who we are : We're a leading, global security authority that's disrupting our own category. Our encryption is trusted by the major ecommerce brands, the world's largest companies, the major cloud providers, entire country financial systems, entire internets of things and even down to the little things like surgically embedded pacemakers. We help companies put trust an abstract idea to work. That's digital trust for the real world. Job Summary : DigiCert is seeking to hire a Software Engineering…",
        "url": "https://www.adzuna.in/land/ad/5016201762?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=2E712AC97A82CF9AA42FA261AEC791E4563CB93F"
    },
    {
        "title": "UI Software Engineer - Javascript",
        "company": "HyrEzy Talent Solutions",
        "location": "India",
        "description": "About the Role : We are looking to hire an enthusiastic and motivated software engineer, should have multiple years of experience building SaaS applications leveraging Cloud. He / She will be a member of our software engineering team, working on exciting new products and solving complex business problems using cutting edge technology in big data, machine learning and Artificial Intelligence space. As part of the Frontend engineering team, will work directly with engineers in a dynamic, open env…",
        "url": "https://www.adzuna.in/land/ad/5018888369?se=mB93KzTa7xG-r4ZSfONlkQ&utm_medium=api&utm_source=bfb2e568&v=D40724B5B1B868836C98673F477493253CED5043"
    }
]